#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_region.us-east-1: Reading...
data.aws_region.us-east-1: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_iam_policy_document.assume_role: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
data.aws_region.current: Reading...
aws_route53_zone.main: Refreshing state... [id=Z0726564EKTZ6CT8UX0O]
module.vpc.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_region.current: Reading...
module.vpc.aws_eip.nat_gateway[2]: Refreshing state... [id=eipalloc-0b8b69031f6b1e150]
module.vpc.aws_eip.nat_gateway[0]: Refreshing state... [id=eipalloc-020a7acda2123c1a7]
module.vpc.aws_kms_key.custom_kms_key[0]: Refreshing state... [id=a28f1756-15cf-4d0b-8ae2-66385a5992bb]
module.vpc.aws_eip.nat_gateway[1]: Refreshing state... [id=eipalloc-08b72ec6f9fef9c6c]
module.vpc.data.aws_region.current: Read complete after 0s [id=us-east-2]
data.aws_region.current: Read complete after 0s [id=us-east-2]
module.vpc.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]
data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0c21c2ff9958bd470]
aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:us-east-2:743794601996:certificate/60c8e294-c21f-4097-a6ac-92c311262f71]
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
data.aws_ami.amazon_ami: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
module.vpc.aws_iam_role.vpc_flow_log_role[0]: Refreshing state... [id=app-2-vpc-flow-role]
aws_s3_bucket.artifacts: Refreshing state... [id=743794601996-app-2-artifacts]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc.aws_cloudwatch_log_group.network_flow_logging[0]: Refreshing state... [id=app-2-flow-logs]
module.vpc.aws_kms_alias.key[0]: Refreshing state... [id=alias/app-2-encrypt-flow-log]
module.vpc.aws_kms_key_policy.encrypt_log[0]: Refreshing state... [id=a28f1756-15cf-4d0b-8ae2-66385a5992bb]
aws_kms_key.waf_log: Refreshing state... [id=561646ce-0392-4b1e-9a00-b90480d7cb13]
aws_route53_record.acm_validation["kunduso.com"]: Refreshing state... [id=Z0726564EKTZ6CT8UX0O__373a28aa8a2669626e6595d0ca44d8d3.kunduso.com._CNAME]
aws_acm_certificate_validation.main: Refreshing state... [id=2025-04-07 22:01:36.055 +0000 UTC]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0]: Read complete after 0s [id=1656623650]
module.vpc.aws_iam_role_policy.vpc_flow_log_role_policy[0]: Refreshing state... [id=app-2-vpc-flow-role:app-2-vpc-flow-policy]
aws_kms_alias.waf_log: Refreshing state... [id=alias/app-2-lb-waf-cloudwatch-logs]
aws_cloudwatch_log_group.waf_log_group: Refreshing state... [id=aws-waf-logs-app-2]
data.aws_ami.amazon_ami: Read complete after 0s [id=ami-007faf01115b04116]
aws_wafv2_web_acl.main: Refreshing state... [id=b72bb13e-f666-4b2d-bc87-6be4ec84e410]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0d55680dea6d9be62]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-078e91c94e31107d2]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-031de891bbad89400]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-087ea9cb4161cfe55]
module.vpc.aws_internet_gateway.this_igw[0]: Refreshing state... [id=igw-0af55d16df500b3de]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0709e4bf3eeba137e]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-081550d717c6f1319]
aws_lb_target_group.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/9bea30d921f2c42b]
module.vpc.aws_flow_log.network_flow_logging[0]: Refreshing state... [id=fl-075db9bb74e26bed0]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0726289cf4d13c60c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04ed3fff5873a5d53]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-092fd5825feb3ee12]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0392e390898bd0657]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b5b60d45644fbc5c]
aws_security_group.lb_security_group: Refreshing state... [id=sg-0f7244e980ead087f]
aws_security_group.ec2_security_group: Refreshing state... [id=sg-06b603687b1bbe7f1]
aws_s3_bucket_public_access_block.artifacts: Refreshing state... [id=743794601996-app-2-artifacts]
aws_s3_bucket_policy.alb_logs: Refreshing state... [id=743794601996-app-2-artifacts]
aws_s3_bucket_server_side_encryption_configuration.encrypt_bucket: Refreshing state... [id=743794601996-app-2-artifacts]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a609d9c3428a69fb]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0be3ff89ce9acfc8a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02f37e206db634917]
module.vpc.aws_route.internet_route[0]: Refreshing state... [id=r-rtb-0392e390898bd06571080289494]
aws_security_group_rule.ingress_load_balancer: Refreshing state... [id=sgrule-3395428374]
aws_security_group_rule.egress_load_balancer: Refreshing state... [id=sgrule-2857856002]
module.vpc.aws_nat_gateway.public[2]: Refreshing state... [id=nat-0fa22003d22de8aef]
aws_lb.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-2-front/16c5b28e284adf4a]
aws_security_group_rule.egress_ec2: Refreshing state... [id=sgrule-1961599527]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0dc175ae3e8804d75]
aws_security_group_rule.ingress_from_ec2: Refreshing state... [id=sgrule-3202017815]
module.vpc.aws_nat_gateway.public[0]: Refreshing state... [id=nat-0cda7874253d1ba39]
module.vpc.aws_nat_gateway.public[1]: Refreshing state... [id=nat-0f1ef84ef1d1ceccf]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-09c83716d007fcc7d]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b51a6d47a3366428]
aws_instance.app-server[0]: Refreshing state... [id=i-0a196fb26a184491a]
aws_instance.app-server[1]: Refreshing state... [id=i-0b7b0a4bbf608115f]
aws_instance.app-server[2]: Refreshing state... [id=i-04ba24dc220fbc13f]
aws_security_group_rule.ingress_ec2: Refreshing state... [id=sgrule-2869705919]
module.vpc.aws_route.private_route[0]: Refreshing state... [id=r-rtb-04ed3fff5873a5d531080289494]
module.vpc.aws_route.private_route[1]: Refreshing state... [id=r-rtb-031de891bbad894001080289494]
module.vpc.aws_route.private_route[2]: Refreshing state... [id=r-rtb-081550d717c6f13191080289494]
aws_route53_record.alb: Refreshing state... [id=Z0726564EKTZ6CT8UX0O_kunduso.com_A]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-2-front/16c5b28e284adf4a/62613d5765171498]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-2-front/16c5b28e284adf4a/9be58b77d66332d4]
aws_lb_target_group_attachment.attach-ec2[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/9bea30d921f2c42b-20250407183807740100000009]
aws_lb_target_group_attachment.attach-ec2[2]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/9bea30d921f2c42b-20250407183807616400000008]
aws_lb_target_group_attachment.attach-ec2[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/9bea30d921f2c42b-2025040718380788690000000a]
aws_wafv2_web_acl_association.main: Refreshing state... [id=arn:aws:wafv2:us-east-2:743794601996:regional/webacl/app-2-web-acl/b72bb13e-f666-4b2d-bc87-6be4ec84e410,arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-2-front/16c5b28e284adf4a]
aws_wafv2_web_acl_logging_configuration.main: Refreshing state... [id=arn:aws:wafv2:us-east-2:743794601996:regional/webacl/app-2-web-acl/b72bb13e-f666-4b2d-bc87-6be4ec84e410]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.dns_query_log_group will be created
  + resource "aws_cloudwatch_log_group" "dns_query_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/route53/app-2/dns-query-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
    }

  # aws_instance.app-server[0] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-0a196fb26a184491a"
        tags                                 = {
            "Name" = "app-2-server-1"
        }
      ~ user_data                            = "6c94caa45597f8ebb40dbc6e6e569d3a847602b8" -> "ef1e37efa528ef8875cc8044a31f60d16b4db1e1"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.app-server[1] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-0b7b0a4bbf608115f"
        tags                                 = {
            "Name" = "app-2-server-2"
        }
      ~ user_data                            = "6c94caa45597f8ebb40dbc6e6e569d3a847602b8" -> "ef1e37efa528ef8875cc8044a31f60d16b4db1e1"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.app-server[2] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-04ba24dc220fbc13f"
        tags                                 = {
            "Name" = "app-2-server-3"
        }
      ~ user_data                            = "6c94caa45597f8ebb40dbc6e6e569d3a847602b8" -> "ef1e37efa528ef8875cc8044a31f60d16b4db1e1"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_kms_alias.dns_query_log will be created
  + resource "aws_kms_alias" "dns_query_log" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/app-2-dns-query-cloudwatch-logs"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.dns_query_log will be created
  + resource "aws_kms_key" "dns_query_log" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key to encrypt DNS query logs."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::743794601996:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:us-east-1:743794601996:log-group:/aws/route53/app-2/dns-query-logs*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-1.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
    }

  # aws_route53_query_log.dns_query will be created
  + resource "aws_route53_query_log" "dns_query" {
      + arn                      = (known after apply)
      + cloudwatch_log_group_arn = (known after apply)
      + id                       = (known after apply)
      + zone_id                  = "Z0726564EKTZ6CT8UX0O"
    }

Plan: 4 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*